; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	thermograph2 - mode
	image5 - mode
	spectrograph3 - mode
	infrared9 - mode
	spectrograph4 - mode
	spectrograph7 - mode
	image0 - mode
	thermograph6 - mode
	thermograph1 - mode
	infrared8 - mode
	Star0 - direction
	GroundStation4 - direction
	Star1 - direction
	Star3 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 spectrograph7)
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph7)
	(supports instrument1 spectrograph4)
	(supports instrument1 infrared9)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 image0)
	(supports instrument2 spectrograph7)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 infrared8)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument4 image0)
	(supports instrument4 spectrograph4)
	(supports instrument4 thermograph6)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared8)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star3)
	(supports instrument8 infrared8)
	(supports instrument8 spectrograph7)
	(supports instrument8 thermograph6)
	(supports instrument8 image5)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(have_image Phenomenon5 thermograph6)
	(have_image Planet6 infrared8)
	(have_image Planet6 infrared9)
	(have_image Star7 spectrograph4)
	(have_image Star7 infrared8)
	(have_image Star7 thermograph1)
	(have_image Planet8 infrared9)
	(have_image Star9 infrared9)
))

)

; plan
1. (turn_to satellite3 groundstation2 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 groundstation2)
   goals met: 0 of 8
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 8
3. (calibrate satellite3 instrument8 groundstation2)
   added: (calibrated instrument8)
   goals met: 0 of 8
4. (turn_to satellite3 star7 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star7)
   goals met: 0 of 8
5. (take_image satellite3 star7 instrument8 infrared8)
   added: (have_image star7 infrared8)
   goals met: 1 of 8
6. (turn_to satellite3 planet6 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 planet6)
   goals met: 1 of 8
7. (take_image satellite3 planet6 instrument8 infrared8)
   added: (have_image planet6 infrared8)
   goals met: 2 of 8
8. (turn_to satellite3 phenomenon5 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon5)
   goals met: 2 of 8
9. (take_image satellite3 phenomenon5 instrument8 thermograph6)
   added: (have_image phenomenon5 thermograph6)
   goals met: 3 of 8
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 8
11. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 3 of 8
12. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 3 of 8
13. (take_image satellite0 star7 instrument0 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 4 of 8
14. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 8
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 8
16. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 8
17. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 4 of 8
18. (turn_to satellite0 planet6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet6)
   goals met: 4 of 8
19. (take_image satellite0 planet6 instrument1 infrared9)
   added: (have_image planet6 infrared9)
   goals met: 5 of 8
20. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 5 of 8
21. (take_image satellite0 planet8 instrument1 infrared9)
   added: (have_image planet8 infrared9)
   goals met: 6 of 8
22. (turn_to satellite0 star7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star7)
   goals met: 6 of 8
23. (take_image satellite0 star7 instrument1 spectrograph4)
   added: (have_image star7 spectrograph4)
   goals met: 7 of 8
24. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 7 of 8
25. (take_image satellite0 star9 instrument1 infrared9)
   added: (have_image star9 infrared9)
   goals met: 8 of 8
